In [1]:
import pandas as pd
import sqlite3
db = sqlite3.connect("school.sqlite")

In [2]:
data = pd.read_sql_query("select *from student ",db)
data

   rollno      name  age
0     101     mohit   21
1     103       raj   23
2     104      maya   23
3     106  avantika   20
4     107    ankush   20

In [3]:
data = pd.DataFrame([[201,"aman","english",20000],[202,"rakhi",'Hindi',20000],[203,"retesh","maths",30000]],columns = ["ID","Name","Subject","Salary"])
data

    ID    Name  Subject  Salary
0  201    aman  english   20000
1  202   rakhi    Hindi   20000
2  203  retesh    maths   30000

In [4]:
data.to_sql("Faculty",db)

3

In [5]:
data = pd.read_sql_query("select *from student ",db)
data["Address"] = "text"

In [6]:
data

   rollno      name  age Address
0     101     mohit   21    text
1     103       raj   23    text
2     104      maya   23    text
3     106  avantika   20    text
4     107    ankush   20    text

In [7]:
data.to_sql("student",db,if_exists = "replace")

5